RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/drv_eth.c
    IOMUXC_EnableMode(IOMUXC_GPR, kIOMUXC_GPR_ENET1TxClkOutputDir, true);
    IOMUXC_GPR->GPR1 |= 1 << 23;
#endif
}

#ifdef SOC_IMXRT1170_SERIES
static void *_enet_rx_alloc(ENET_Type *base, void *userData, uint8_t ringId)
{
    void *buffer = NULL;
    int i;

    // dbg_log(DBG_LOG, "get buff_wait sem in %d\r\n", __LINE__);
    rt_sem_take(&imxrt_eth_device.buff_wait, RT_WAITING_FOREVER);

    for (i = 0; i < ENET_RXBUFF_NUM; i++)
    {
        if (!imxrt_eth_device.RxPbufs[i].buffer_used)
        {
            imxrt_eth_device.RxPbufs[i].buffer_used = true;
            buffer = &imxrt_eth_device.RxDataBuff[i];
            break;
        }
    }

    rt_sem_release(&imxrt_eth_device.buff_wait);
    // dbg_log(DBG_LOG, "release buff_wait sem in %d\r\n", __LINE__);

    return buffer;
}

static void _enet_rx_free(ENET_Type *base, void *buffer, void *userData, uint8_t ringId)
{
    int idx = ((rx_buffer_t *)buffer) - imxrt_eth_device.RxDataBuff;
    if (!((idx >= 0) && (idx < ENET_RXBUFF_NUM)))
    {
        LOG_E("Freed buffer out of range\r\n");
    }

    // dbg_log(DBG_LOG, "get buff_wait sem in %d\r\n", __LINE__);
    rt_sem_take(&imxrt_eth_device.buff_wait, RT_WAITING_FOREVER);
    if (!(imxrt_eth_device.RxPbufs[idx].buffer_used))
    {
        LOG_E("_enet_rx_free: freeing unallocated buffer\r\n");
    }
    imxrt_eth_device.RxPbufs[idx].buffer_used = false;
    rt_sem_release(&imxrt_eth_device.buff_wait);
    // dbg_log(DBG_LOG, "release buff_wait sem in %d\r\n", __LINE__);
}

/**
 * Reclaims RX buffer held by the p after p is no longer used
 * by the application / lwIP.
 */
static void _enet_rx_release(struct pbuf *p)
{
    rx_pbuf_wrapper_t *wrapper = (rx_pbuf_wrapper_t *)p;
    _enet_rx_free(imxrt_eth_device.enet_base, wrapper->buffer, &imxrt_eth_device, 0);
}
#endif

static void _enet_config(void)
{
    enet_config_t config;
    uint32_t sysClock;

/* prepare the buffer configuration. */
#ifndef SOC_IMXRT1170_SERIES
    enet_buffer_config_t buffConfig =
        {
            ENET_RXBD_NUM,
            ENET_TXBD_NUM,
            SDK_SIZEALIGN(ENET_RXBUFF_SIZE, ENET_BUFF_ALIGNMENT),
            SDK_SIZEALIGN(ENET_TXBUFF_SIZE, ENET_BUFF_ALIGNMENT),
            &g_rxBuffDescrip[0],
            &g_txBuffDescrip[0],
            &g_rxDataBuff[0][0],
            &g_txDataBuff[0][0],
        };
    /* Get default configuration. */
    /*
     * config.miiMode = kENET_RmiiMode;
     * config.miiSpeed = kENET_MiiSpeed100M;
     * config.miiDuplex = kENET_MiiFullDuplex;
     * config.rxMaxFrameLen = ENET_FRAME_MAX_FRAMELEN;
     */
    ENET_GetDefaultConfig(&config);
    config.interrupt = kENET_TxFrameInterrupt | kENET_RxFrameInterrupt;
    config.miiSpeed = imxrt_eth_device.speed;
    config.miiDuplex = imxrt_eth_device.duplex;

    /* Set SMI to get PHY link status. */
    sysClock = CLOCK_GetFreq(kCLOCK_AhbClk);

    dbg_log(DBG_LOG, "deinit\n");
    ENET_Deinit(imxrt_eth_device.enet_base);
    dbg_log(DBG_LOG, "init\n");
    ENET_Init(imxrt_eth_device.enet_base, &imxrt_eth_device.enet_handle, &config, &buffConfig, &imxrt_eth_device.dev_addr[0], sysClock);
    dbg_log(DBG_LOG, "set call back\n");
    ENET_SetCallback(&imxrt_eth_device.enet_handle, _enet_callback, &imxrt_eth_device);
    dbg_log(DBG_LOG, "active read\n");
    ENET_ActiveRead(imxrt_eth_device.enet_base);
#else
    int i;
    enet_buffer_config_t buffConfig[ENET_RING_NUM];
    imxrt_eth_device.RxBuffDescrip = &g_rxBuffDescrip[0];
    imxrt_eth_device.TxBuffDescrip = &g_txBuffDescrip[0];
    imxrt_eth_device.RxDataBuff = &g_rxDataBuff[0];
    imxrt_eth_device.TxDataBuff = &g_txDataBuff[0];
    buffConfig[0].rxBdNumber = ENET_RXBD_NUM;            /* Receive buffer descriptor number. */
    buffConfig[0].txBdNumber = ENET_TXBD_NUM;            /* Transmit buffer descriptor number. */
    buffConfig[0].rxBuffSizeAlign = sizeof(rx_buffer_t); /* Aligned receive data buffer size. */
    buffConfig[0].txBuffSizeAlign = sizeof(tx_buffer_t); /* Aligned transmit data buffer size. */
    buffConfig[0].rxBdStartAddrAlign =
        &(imxrt_eth_device.RxBuffDescrip[0]); /* Aligned receive buffer descriptor start address. */
    buffConfig[0].txBdStartAddrAlign =
        &(imxrt_eth_device.TxBuffDescrip[0]); /* Aligned transmit buffer descriptor start address. */
    buffConfig[0].rxBufferAlign =
        NULL;                                                           /* Receive data buffer start address. NULL when buffers are allocated by callback for RX zero-copy. */
    buffConfig[0].txBufferAlign = &(imxrt_eth_device.TxDataBuff[0][0]); /* Transmit data buffer start address. */
    buffConfig[0].txFrameInfo = NULL;                                   /* Transmit frame information start address. Set only if using zero-copy transmit. */
    buffConfig[0].rxMaintainEnable = true;                              /* Receive buffer cache maintain. */
    buffConfig[0].txMaintainEnable = true;                              /* Transmit buffer cache maintain. */

    /* Get default configuration. */
    /*
     * config.miiMode = kENET_RmiiMode;
     * config.miiSpeed = kENET_MiiSpeed100M;
     * config.miiDuplex = kENET_MiiFullDuplex;
     * config.rxMaxFrameLen = ENET_FRAME_MAX_FRAMELEN;
     */
    ENET_GetDefaultConfig(&config);
    config.ringNum = ENET_RING_NUM;
    config.miiSpeed = imxrt_eth_device.speed;
    config.miiDuplex = imxrt_eth_device.duplex;
#ifdef PHY_USING_RTL8211F
    config.miiMode = kENET_RgmiiMode;
    EnableIRQ(ENET_1G_MAC0_Tx_Rx_1_IRQn);
    EnableIRQ(ENET_1G_MAC0_Tx_Rx_2_IRQn);
#else
    config.miiMode = kENET_RmiiMode;
#endif
    config.rxBuffAlloc = _enet_rx_alloc;
    config.rxBuffFree = _enet_rx_free;
    config.userData = &imxrt_eth_device;
    /* Set SMI to get PHY link status. */
    sysClock = CLOCK_GetRootClockFreq(kCLOCK_Root_Bus);

    config.interrupt |= kENET_TxFrameInterrupt | kENET_RxFrameInterrupt | kENET_TxBufferInterrupt | kENET_LateCollisionInterrupt;
    config.callback = _enet_callback;

    for (i = 0; i < ENET_RXBUFF_NUM; i++)
    {
        imxrt_eth_device.RxPbufs[i].p.custom_free_function = _enet_rx_release;
        imxrt_eth_device.RxPbufs[i].buffer = &(imxrt_eth_device.RxDataBuff[i][0]);
        imxrt_eth_device.RxPbufs[i].buffer_used = false;
    }

    // dbg_log(DBG_LOG, "deinit\n");
    // ENET_Deinit(imxrt_eth_device.enet_base);
    dbg_log(DBG_LOG, "init\n");
    ENET_Init(imxrt_eth_device.enet_base, &imxrt_eth_device.enet_handle, &config, &buffConfig[0], &imxrt_eth_device.dev_addr[0], sysClock);
    // dbg_log(DBG_LOG, "set call back\n");
    // ENET_SetCallback(&imxrt_eth_device.enet_handle, _enet_callback, &imxrt_eth_device);
    dbg_log(DBG_LOG, "active read\n");
    ENET_ActiveRead(imxrt_eth_device.enet_base);
#endif
}

#if defined(ETH_RX_DUMP) || defined(ETH_TX_DUMP)
static void packet_dump(const char *msg, const struct pbuf *p)
{
    const struct pbuf *q;
    rt_uint32_t i, j;
    rt_uint8_t *ptr;

