RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/drv_eth.c
            /* Get the current buffer descriptor address. */
            curBuffDescrip = handle->txBdCurrent[0];

        } while (!(curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_READY_MASK));

        return kStatus_ENET_TxFrameBusy;
    }
}
#endif

/* ethernet device interface */
/* transmit packet. */
rt_err_t rt_imxrt_eth_tx(rt_device_t dev, struct pbuf *p)
{
    rt_err_t result = RT_EOK;
    enet_handle_t *enet_handle = &imxrt_eth_device.enet_handle;

    RT_ASSERT(p != NULL);
    RT_ASSERT(enet_handle != RT_NULL);

    dbg_log(DBG_LOG, "rt_imxrt_eth_tx: %d\n", p->len);

#ifdef ETH_TX_DUMP
    packet_dump("send", p);
#endif

    do
    {
#ifdef SOC_IMXRT1170_SERIES
        result = _ENET_SendFrame(imxrt_eth_device.enet_base, enet_handle, (const uint8_t *)p, p->tot_len, RING_ID, false, NULL);
#else
        result = _ENET_SendFrame(imxrt_eth_device.enet_base, enet_handle, (const uint8_t *)p, p->tot_len);
#endif

        if (result == kStatus_ENET_TxFrameBusy)
        {
            imxrt_eth_device.tx_is_waiting = RT_TRUE;
            rt_sem_take(&imxrt_eth_device.tx_wait, RT_WAITING_FOREVER);
        }

    } while (result == kStatus_ENET_TxFrameBusy);

    return RT_EOK;
}

/* reception packet. */
struct pbuf *rt_imxrt_eth_rx(rt_device_t dev)
{
    uint32_t length = 0;
    status_t status;

    struct pbuf *p = RT_NULL;
    enet_handle_t *enet_handle = &imxrt_eth_device.enet_handle;
    ENET_Type *enet_base = imxrt_eth_device.enet_base;
    enet_data_error_stats_t *error_statistic = &imxrt_eth_device.error_statistic;

/* Get the Frame size */
#ifdef SOC_IMXRT1170_SERIES
    status = ENET_GetRxFrameSize(enet_handle, &length, RING_ID);
#else
    status = ENET_GetRxFrameSize(enet_handle, &length);
#endif

    /* Call ENET_ReadFrame when there is a received frame. */
    if (length != 0)
    {
        /* Received valid frame. Deliver the rx buffer with the size equal to length. */
        p = pbuf_alloc(PBUF_RAW, length, PBUF_POOL);

        if (p != NULL)
        {
#ifdef SOC_IMXRT1170_SERIES
            status = ENET_ReadFrame(enet_base, enet_handle, p->payload, length, RING_ID, NULL);
#else
            status = ENET_ReadFrame(enet_base, enet_handle, p->payload, length);
#endif
            if (status == kStatus_Success)
            {
#ifdef ETH_RX_DUMP
                packet_dump("recv", p);
#endif
                return p;
            }
            else
            {
                dbg_log(DBG_LOG, " A frame read failed\n");
                pbuf_free(p);
            }
        }
        else
        {
            dbg_log(DBG_LOG, " pbuf_alloc faild\n");
        }
    }
    else if (status == kStatus_ENET_RxFrameError)
    {
        dbg_log(DBG_WARNING, "ENET_GetRxFrameSize: kStatus_ENET_RxFrameError\n");
        /* Update the received buffer when error happened. */
#ifdef SOC_IMXRT1170_SERIES
        /* Get the error information of the received g_frame. */
        ENET_GetRxErrBeforeReadFrame(enet_handle, error_statistic, RING_ID);
        /* update the receive buffer. */
        ENET_ReadFrame(enet_base, enet_handle, NULL, 0, RING_ID, NULL);
#else
        /* Get the error information of the received g_frame. */
        ENET_GetRxErrBeforeReadFrame(enet_handle, error_statistic);
        /* update the receive buffer. */
        ENET_ReadFrame(enet_base, enet_handle, NULL, 0);
#endif
    }

    ENET_EnableInterrupts(enet_base, kENET_RxFrameInterrupt);
    return NULL;
}

#ifdef BSP_USING_PHY
static struct rt_phy_device *phy_dev = RT_NULL;
static void phy_monitor_thread_entry(void *parameter)
{
    rt_uint32_t speed;
    rt_uint32_t duplex;
    rt_bool_t link = RT_FALSE;

#ifdef SOC_IMXRT1170_SERIES
#ifdef PHY_USING_RTL8211F
    phy_dev = (struct rt_phy_device *)rt_device_find("rtl8211f");
    if ((RT_NULL == phy_dev) || (RT_NULL == phy_dev->ops))
    {
        // TODO print warning information
        LOG_E("Can not find phy device called \"rtl8211f\"");
        return;
    }
#else
    phy_dev = (struct rt_phy_device *)rt_device_find("ksz8081");
    if ((RT_NULL == phy_dev) || (RT_NULL == phy_dev->ops))
    {
        // TODO print warning information
        LOG_E("Can not find phy device called \"ksz8081\"");
        return;
    }
#endif
#else
    phy_dev = (struct rt_phy_device *)rt_device_find("rtt-phy");
    if ((RT_NULL == phy_dev) || (RT_NULL == phy_dev->ops))
    {
        // TODO print warning information
        LOG_E("Can not find phy device called \"rtt-phy\"");
        return;
    }
#endif

    if (RT_NULL == phy_dev->ops->init)
    {
        LOG_E("phy driver error!");
        return;
    }
#ifdef SOC_IMXRT1170_SERIES
#ifdef PHY_USING_RTL8211F
    rt_phy_status status = phy_dev->ops->init(imxrt_eth_device.enet_base, PHY_RTL8211F_ADDRESS, CLOCK_GetRootClockFreq(kCLOCK_Root_Bus));
#else
    rt_phy_status status = phy_dev->ops->init(imxrt_eth_device.enet_base, PHY_KSZ8081_ADDRESS, CLOCK_GetRootClockFreq(kCLOCK_Root_Bus));
#endif
#else
    rt_phy_status status = phy_dev->ops->init(imxrt_eth_device.enet_base, PHY_DEVICE_ADDRESS, CLOCK_GetFreq(kCLOCK_AhbClk));
#endif
    if (PHY_STATUS_OK != status)
    {
        LOG_E("Phy device initialize unsuccessful!\n");
        return;
    }
    LOG_I("Phy device initialize successfully!\n");
    while (1)
    {
        rt_bool_t new_link = RT_FALSE;
        rt_phy_status status = phy_dev->ops->get_link_status(&new_link);

        if ((PHY_STATUS_OK == status) && (link != new_link))
        {
            link = new_link;

            if (link) // link up
            {
                phy_dev->ops->get_link_speed_duplex(&speed, &duplex);

                if (PHY_SPEED_10M == speed)
                {
                    dbg_log(DBG_LOG, "10M\n");
                }
                else if (PHY_SPEED_100M == speed)
                {
                    dbg_log(DBG_LOG, "100M\n");
                }
                else
                {
                    dbg_log(DBG_LOG, "1000M\n");
                }

                if (PHY_HALF_DUPLEX == duplex)
                {
                    dbg_log(DBG_LOG, "half dumplex\n");
                }
                else
                {
                    dbg_log(DBG_LOG, "full dumplex\n");
                }

